Octopus/InformationRegisters/ФотоДляВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ФотоДляВыгрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.vrgРеализацияМобильная</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgИнвентаризацияМобильная</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgЗаказКлиентаМобильный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgВозвратМобильный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgТребованияНакладнаяМобыльный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.vrgИнвентаризацияМобильная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерФото</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/CommonForms/ФормаДок/Ext/Form/Module.bsl
&НаКлиенте
Процедура НайтиНоменклатуру(Команда)
	ПараметрыФормы = НайтиНоменклатуруНаСервере(СтрокаПоиска);
	Если ПараметрыФормы <> Неопределено Тогда
		ОткрытьФорму("ОбщаяФорма.ПросмотрФото", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
функция НайтиНоменклатуруНаСервере(СтрокаПоиска)
	ТаблицаНоменклатур = ПроцедурыОбменаДанными.НайтиНоменклатуру(СтрокаПоиска);
	Если ТаблицаНоменклатур.Количество() > 0 Тогда 
		Номенклатура = ТаблицаНоменклатур[0].УИД;
		
		ПараметрыОтбора = Новый Структура("УИД",Номенклатура);
		
		МассивСкладов = ТаблицаНоменклатур.НайтиСтроки(ПараметрыОтбора);
		МестаХранения.Очистить();
		Для Каждого Элемент из МассивСкладов Цикл
			
		 НовСтрока = МестаХранения.Добавить();
		 НовСтрока.УИД = Элемент.УИД;
		 //НовСтрока.Склад = Элемент.Склад;
		 //НовСтрока.РядИПолка = Элемент.РядИПолка;
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура("УИД,Наименование,Склады",ТаблицаНоменклатур[0].УИД,ТаблицаНоменклатур[0].Наименование,МестаХранения);
		Возврат ПараметрыФормы
	Иначе
		Сообщить("Не знайдено жодної номенклатури з таким Найменуванням або артиклом!");
		Возврат Неопределено
	КонецЕсли;
Конецфункции

&НаКлиенте
Процедура Обновить(Команда)
	ПолучитьНоменклатуруБезФото();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуруБезФото ()
	СписокБезКартинок.Очистить();
	Склады.Очистить();
	ТаблицаКартинок = ПроцедурыОбменаДанными.ПолучитьТаблицуБезФото();
	Склады.Загрузить(ТаблицаКартинок);
	ТаблицаКартинок.Свернуть("УИД,Наименование,Артикул");
	СписокБезКартинок.Загрузить(ТаблицаКартинок);
КонецПроцедуры

&НаКлиенте
Процедура СписокБезКартинокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.СписокБезКартинок.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыОтбора = Новый Структура("УИД",ТекДанные.УИД);
	МассивСкладов = Склады.НайтиСтроки(ПараметрыОтбора);
	
		МестаХранения.Очистить();
		Для Каждого Элемент из МассивСкладов Цикл
			
		 НовСтрока = МестаХранения.Добавить();
		 НовСтрока.УИД = Элемент.УИД;
		 НовСтрока.Склад = Элемент.Склад;
		 НовСтрока.РядИПолка = Элемент.РядИПолка;
		КонецЦикла;
	
	ПараметрыФормы = Новый Структура("УИД,Наименование,Склады",ТекДанные.УИД,ТекДАнные.Наименование,МестаХранения );
	ОткрытьФорму("ОбщаяФорма.ПросмотрФотоДок", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОтправитьВсеФотоНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФотоДляВыгрузки.НомерФото КАК ИмяФайла,
		|	ФотоДляВыгрузки.ДатаСоздания КАК ДатаСоздания,
		|	ФотоДляВыгрузки.Фото КАК Фото,
		|	ФотоДляВыгрузки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.ФотоДляВыгрузки КАК ФотоДляВыгрузки";

	//Запрос.УстановитьПараметр("НомерДетали",	НомерДеталиЧислом);

	РезультатЗапроса	= Запрос.Выполнить();

	ТаблицаРезультата	= РезультатЗапроса.Выгрузить();

	ХранилищеТаблицы	= Новый ХранилищеЗначения(ТаблицаРезультата);
	Прокси = ПроцедурыОбменаДанными.ПолучитьПрокси();

	Если Прокси = Неопределено Тогда
		Возврат ;
	КонецЕсли;

	

	ОтветСервера = Прокси.ЗагрузитьФото( ХранилищеТаблицы);

	Для Каждого СтрокиОтвета Из ОтветСервера Цикл
		МенеджерЗаписи = РегистрыСведений.ФотоДляВыгрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УИД	= СтрокиОтвета.УИД;
		МенеджерЗаписи.НомерФото	= СтрокиОтвета.Номерфото;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЦикла;
	Сообщить("Всі фотографії відправлені!");
	
	
	//Возврат ОтветСервера;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВсеФото(Команда)
	ОтправитьВсеФотоНаСервере();
	
КонецПроцедуры
